#include "ckeyboard.h"

CKeyboard cKeyboard;

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
// онструктор класса обработки клавиатуры.                          //
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
CKeyboard::CKeyboard()
{
 for(short n=0;n<256;n++) KeyTable[n]=false;
}
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
//ƒеструктор класса обработки клавиатуры.                           //
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
CKeyboard::~CKeyboard()
{ 
}
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
//¬озвращает состо€ние клавиши с номером key.false-не нажата.       //
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
bool CKeyboard::GetPressKey(unsigned char key)
{	
 return(KeyTable[key]);
}
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
//задать состо€ние кнопки                                           //
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
void CKeyboard::SetKeyState(unsigned char key,bool state)
{
 KeyTable[key]=state;	
}



 