#ifndef CMAIN_H
#define CMAIN_H

#include"ccontrol.h"
#include"cvideo.h"

class CMain
{
 protected:
  //-Переменные класса-------------------------------------------------------
  CControl cControl;  
  //-Функции класса----------------------------------------------------------
  //-Прочее------------------------------------------------------------------
 public:
  //-Конструктор класса------------------------------------------------------
  CMain();
  //-Деструктор класса-------------------------------------------------------
  ~CMain();
  //-Переменные класса-------------------------------------------------------
  //-Замещённые функции предка-----------------------------------------------
  //-Новые функции класса----------------------------------------------------
  bool OpenWindow(void);//открытие окна
  bool CloseWindow(void);//закрытие окна
  //-Функции обработки сообщений класса--------------------------------------
  void OnActivate_MouseButton(long x,long y,bool left,bool right,bool center);//нажали или отпустили кнопку мыши
  void OnActivate_Timer(void);//обработка таймера  
  //-Новые функции класса----------------------------------------------------
  //-Прочее------------------------------------------------------------------
};

#endif