#include "csimplyteleport.h"

//----------------------------------------------------------------------------------------------------
//конструктор
//----------------------------------------------------------------------------------------------------
CSimplyTeleport::CSimplyTeleport(CISector *cISector_Set_Ptr):CDecorator_CISector(cISector_Set_Ptr)
{
}

//----------------------------------------------------------------------------------------------------
//инициализация
//----------------------------------------------------------------------------------------------------
void CSimplyTeleport::Initialize(void)
{
 cISector_Ptr->Initialize();
 XT=0;
 YT=0;
}
//----------------------------------------------------------------------------------------------------
//обработка
//----------------------------------------------------------------------------------------------------
void CSimplyTeleport::Processing(void)
{
 cISector_Ptr->Processing();
}
//----------------------------------------------------------------------------------------------------
//активировать
//----------------------------------------------------------------------------------------------------
void CSimplyTeleport::Activate(void)
{
}
//----------------------------------------------------------------------------------------------------
//получить координаты телепортации
//----------------------------------------------------------------------------------------------------
bool CSimplyTeleport::GetTeleportCoord(long &x,long &y)
{
 x=XT;
 y=YT;
 return(true);
}
//----------------------------------------------------------------------------------------------------
//проверка, можно ли активировать сектор из координат (x,y) с максимальным расстоянием активации length
//----------------------------------------------------------------------------------------------------
bool CSimplyTeleport::CheckActivate(float x,float y,float length,long sector_index)
{
 if (cISector_Ptr->GetIndex()==sector_index) return(true);
 return(false);
}
//----------------------------------------------------------------------------------------------------
//загрузка
//----------------------------------------------------------------------------------------------------
void CSimplyTeleport::Load(FILE *file)
{
 cISector_Ptr->Load(file);
 XT=LoadLong(file);
 YT=LoadLong(file);
}
 